# Analytical Equipment Load Data Properties

Source: https://www.revitapidocs.com/2026/05ef96a9-318a-08b5-2e34-593c00cb5d1a.htm

---

| Analytical Equipment Load Data Properties |
| --- |

The AnalyticalEquipmentLoadData type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | ApparentLoad | The electrical apparent load of analytical equipment load. |
|  | ConnectedPhases | The electrical connected phases of the electrical analytical node to its upstream node. (Inherited from AnalyticalDistributionNodePropertyData ) |
|  | Current | The current of the analytical equipment load. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from AnalyticalDistributionNodePropertyData ) |
|  | LoadClassification | The load classification of analytical equipment load. |
|  | LoadSet | The electrical analytical load set of the analytical equipment load. |
|  | LoadType | The load type of analytical equipment load. |
|  | PhasesNumber | The number of electrical phases of the analytical equipment load. |
|  | PowerFactor | The power factor of analytical equipment load. |
|  | PowerFactorState | The PowerFactorState type of the analytical equipment load. |
|  | TrueLoad | The electrical true load of analytical equipment load. |
|  | Voltage | The voltage of the analytical equipment load. |

Top See Also

#### Reference

AnalyticalEquipmentLoadData Class Autodesk.Revit.DB.Electrical Namespace